k6_debug_utf8.txt

          /\      |ÔÇ¥ÔÇ¥| /ÔÇ¥ÔÇ¥/   /ÔÇ¥ÔÇ¥/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ÔÇ¥ÔÇ¥\  
   /          \   |  |\  \ |  (ÔÇ¥)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: load-test-k6.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)

./k6.exe : time="2026-03-24T10:55:58+05:30" level=info msg="Request:\nGET / HTTP/1.1\nHost: [::1]:5173\nUser-Agent: 
k6/0.50.0 (https://k6.io/)\nAccept-Encoding: gzip\n\n\n" group= iter=0 request_id=29628f17-4f0c-4ead-6318-849eaa670dc6 
scenario=default source=http-debug vu=1
At line:1 char:1
+ ./k6.exe run --vus 1 --iterations 1 --http-debug="full" load-test-k6. ...
+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (time="2026-03-2...http-debug vu=1:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
time="2026-03-24T10:55:58+05:30" level=info msg="Response:\nHTTP/1.1 404 Not Found\nConnection: keep-alive\nDate: Tue, 24 
Mar 2026 05:25:58 GMT\nKeep-Alive: timeout=5\nVary: Origin\nContent-Length: 0\n\n\n" group= iter=0 
request_id=29628f17-4f0c-4ead-6318-849eaa670dc6 scenario=default source=http-debug vu=1
time="2026-03-24T10:55:58+05:30" level=info msg="Request failed! Status: 404 Error code: 1404" source=console
time="2026-03-24T10:55:58+05:30" level=warning msg="Error from API server" error="listen tcp 127.0.0.1:6565: bind: Only 
one usage of each socket address (protocol/network address/port) is normally permitted."

running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m01.0s/10m0s  0/1 shared iters

     Ô£ù status is 200
      Ôå│  0% ÔÇö Ô£ô 0 / Ô£ù 1

     checks.....................: 0.00%   Ô£ô 0        Ô£ù 1  
     data_received..............: 143 B   141 B/s
     data_sent..................: 76 B    75 B/s
     http_req_blocked...........: avg=2.14ms min=2.14ms med=2.14ms max=2.14ms p(90)=2.14ms p(95)=2.14ms
     http_req_connecting........: avg=2.14ms min=2.14ms med=2.14ms max=2.14ms p(90)=2.14ms p(95)=2.14ms
   Ô£ô http_req_duration..........: avg=1.52ms min=1.52ms med=1.52ms max=1.52ms p(90)=1.52ms p(95)=1.52ms
   Ô£ù http_req_failed............: 100.00% Ô£ô 1        Ô£ù 0  
     http_req_receiving.........: avg=0s     min=0s     med=0s     max=0s     p(90)=0s     p(95)=0s    
     http_req_sending...........: avg=0s     min=0s     med=0s     max=0s     p(90)=0s     p(95)=0s    
     http_req_tls_handshaking...: avg=0s     min=0s     med=0s     max=0s     p(90)=0s     p(95)=0s    
     http_req_waiting...........: avg=1.52ms min=1.52ms med=1.52ms max=1.52ms p(90)=1.52ms p(95)=1.52ms
     http_reqs..................: 1       0.986119/s
     iteration_duration.........: avg=1.01s  min=1.01s  med=1.01s  max=1.01s  p(90)=1.01s  p(95)=1.01s 
     iterations.................: 1       0.986119/s
     vus........................: 1       min=1      max=1
     vus_max....................: 1       min=1      max=1


running (00m01.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 1 VUs  00m01.0s/10m0s  1/1 shared iters
time="2026-03-24T10:56:01+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"